---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.GridColor
source: html/2cb8e9c3-6328-b4d9-22e0-01b54dd7bdaa.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.GridColor Property

Color of grid lines.

## Syntax (C#)
```csharp
public Color GridColor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null